print("""
▄▄▄▄·  ▄▄▄·  ▐ ▄ ·▄▄▄▄       ▐ ▄  ▄▄▄· • ▌ ▄ ·. ▄▄▄ .     ▄▄ • ▄▄▄ . ▐ ▄ ▄▄▄ .▄▄▄   ▄▄▄· ▄▄▄▄▄      ▄▄▄  
▐█ ▀█▪▐█ ▀█ •█▌▐███▪ ██     •█▌▐█▐█ ▀█ ·██ ▐███▪▀▄.▀·    ▐█ ▀ ▪▀▄.▀·•█▌▐█▀▄.▀·▀▄ █·▐█ ▀█ •██  ▪     ▀▄ █·
▐█▀▀█▄▄█▀▀█ ▐█▐▐▌▐█· ▐█▌    ▐█▐▐▌▄█▀▀█ ▐█ ▌▐▌▐█·▐▀▀▪▄    ▄█ ▀█▄▐▀▀▪▄▐█▐▐▌▐▀▀▪▄▐▀▀▄ ▄█▀▀█  ▐█.▪ ▄█▀▄ ▐▀▀▄ 
██▄▪▐█▐█ ▪▐▌██▐█▌██. ██     ██▐█▌▐█ ▪▐▌██ ██▌▐█▌▐█▄▄▌    ▐█▄▪▐█▐█▄▄▌██▐█▌▐█▄▄▌▐█•█▌▐█ ▪▐▌ ▐█▌·▐█▌.▐▌▐█•█▌
·▀▀▀▀  ▀  ▀ ▀▀ █▪▀▀▀▀▀•     ▀▀ █▪ ▀  ▀ ▀▀  █▪▀▀▀ ▀▀▀     ·▀▀▀▀  ▀▀▀ ▀▀ █▪ ▀▀▀ .▀  ▀ ▀  ▀  ▀▀▀  ▀█▄▀▪.▀  ▀
""")

print(f"\nWelcome to The Band Name Generator."
      "We'll help you come up with a fantastic name for your music band.")

user_name = input("\nWhat's your name : ")

city_name = input(f"\nHi {user_name}! What's the name of the city you grew up in? : ")

pet_name = input("\nInteresting! What's the name of your pet you have or had? : ")

print(f"""
----------------------------------------------------
Great! Your band name could be: {city_name} {pet_name}
               🎸🥁 Rock On! 🎸🥁
----------------------------------------------------""")
